keroro1768/M487_ScsiTool/tool/M487Filter/driver/M487FilterIntercept.c
/*++

Copyright (c) 2026. All rights reserved.

Module Name:

    M487FilterIntercept.c

Abstract:

    HID IOCTL interception implementation for M487 HID Upper Filter Driver.
    Captures and optionally modifies HID IOCTLs passing through the filter.

    IOCTL Flow (Firefly reference):
      WdfIoTargetOpen(PDO name)
        → IOCTL_HID_GET_COLLECTION_INFORMATION
        → IOCTL_HID_GET_COLLECTION_DESCRIPTOR
        → HidP_GetCaps()
        → IOCTL_HID_SET_FEATURE  ← intercepted
        → IOCTL_HID_GET_FEATURE  ← intercepted
        → IOCTL_HID_WRITE_REPORT  ← intercepted
        → IOCTL_HID_READ_REPORT   ← intercepted

Environment:

    Kernel mode

--*/

#include "M487Filter.h"

#ifdef ALLOC_PRAGMA
#pragma alloc_text(PAGE, M487InterceptInitialize)
#pragma alloc_text(PAGE, M487InterceptRegisterIoctls)
#pragma alloc_text(PAGE, M487InterceptEvtIoDeviceControl)
#pragma alloc_text(PAGE, M487InterceptGetConfig)
#pragma alloc_text(PAGE, M487InterceptSetConfig)
#pragma alloc_text(PAGE, M487InterceptMapRingBufferToUser)
#endif

//
// Nt native syscall declarations for section/mapping operations.
// These are available in kernel mode via ntddk.h / wdm.h.
//
NTSYSAPI
NTSTATUS
NTAPI
ZwCreateSection(
    OUT PHANDLE SectionHandle,
    IN ACCESS_MASK DesiredAccess,
    IN POBJECT_ATTRIBUTES ObjectAttributes OPTIONAL,
    IN PLARGE_INTEGER MaximumSize OPTIONAL,
    IN ULONG PageAttribut,
    IN ULONG SectionAttributes,
    IN HANDLE FileHandle OPTIONAL
    );

NTSYSAPI
NTSTATUS
NTAPI
ZwMapViewOfSection(
    IN HANDLE SectionHandle,
    IN HANDLE ProcessHandle,
    IN OUT PVOID *BaseAddress,
    IN ULONG_PTR ZeroBits OPTIONAL,
    IN SIZE_T RegionSize,
    IN OUT PLARGE_INTEGER SectionOffset OPTIONAL,
    IN OUT PSIZE_T ViewSize,
    IN SECTION_INHERIT InheritDisposition,
    IN ULONG AllocationType,
    IN ULONG Protect
    );

NTSYSAPI
NTSTATUS
NTAPI
ZwUnmapViewOfSection(
    IN HANDLE ProcessHandle,
    IN PVOID BaseAddress
    );

NTSYSAPI
NTSTATUS
NTAPI
ZwClose(
    IN HANDLE Handle
    );

//
// Ring buffer mapping helper - creates a section object and maps it into
// both kernel and user address spaces. Returns the user-mode virtual address.
//
static
NTSTATUS
M487InterceptCreateUserMapping(
    _In_ PDEVICE_CONTEXT DevContext,
    _Out_ PHANDLE SectionHandle,
    _Out_ PVOID* KernelMappingVa,
    _Out_ PVOID* UserVa
    )
{
    NTSTATUS status;
    HANDLE sectionHandle;
    LARGE_INTEGER sectionSize;
    PVOID kernelVa = NULL;
    PVOID userVa = NULL;
    SIZE_T viewSize;
    LARGE_INTEGER sectionOffset;
    PM487_RING_BUFFER ringBuffer;
    SIZE_T ringByteSize;

    *SectionHandle = NULL;
    *KernelMappingVa = NULL;
    *UserVa = NULL;

    ringBuffer = &DevContext->InterceptState.RingBuffer;
    if (ringBuffer->Control == NULL) {
        return STATUS_INVALID_DEVICE_STATE;
    }

    ringByteSize = ringBuffer->Control->RingByteSize;

    //
    // Create a section object for sharing the ring buffer with user-mode
    //
    sectionSize.QuadPart = (LONGLONG)ringByteSize;

    status = ZwCreateSection(
        &sectionHandle,
        SECTION_ALL_ACCESS,           // DesiredAccess
        NULL,                          // ObjectAttributes (no name, no security)
        &sectionSize,                  // MaximumSize
        PAGE_READWRITE,                // PageAttribut (read/write pages)
        SEC_COMMIT,                    // SectionAttributes (commit pages)
        NULL                           // FileHandle (memory section, not file-backed)
        );

    if (!NT_SUCCESS(status)) {
        KdPrint(("M487Filter: ZwCreateSection failed 0x%x\n", status));
        return status;
    }

    //
    // Map the section into kernel address space (for copying data)
    //
    viewSize = ringByteSize;
    sectionOffset.QuadPart = 0;
    kernelVa = NULL;  // Let the system choose the kernel address

    status = ZwMapViewOfSection(
        sectionHandle,
        (HANDLE)-1,                   // Current process
        &kernelVa,
        0,                             // ZeroBits
        viewSize,
        &sectionOffset,
        &viewSize,
        ViewShare,                     // InheritDisposition
        0,                             // AllocationType
        PAGE_READWRITE                 // Protect
        );

    if (!NT_SUCCESS(status)) {
        KdPrint(("M487Filter: ZwMapViewOfSection (kernel) failed 0x%x\n", status));
        ZwClose(sectionHandle);
        return status;
    }

    //
    // Copy the current ring buffer contents to the shared section
    //
    RtlCopyMemory(kernelVa, ringBuffer->Control, ringByteSize);

    //
    // Map the section into user address space (the requesting user-mode process)
    //
    viewSize = ringByteSize;
    sectionOffset.QuadPart = 0;
    userVa = NULL;  // Let the system choose the user-mode address

    status = ZwMapViewOfSection(
        sectionHandle,
        (HANDLE)-1,                   // Current user process
        &userVa,
        0,
        viewSize,
        &sectionOffset,
        &viewSize,
        ViewShare,
        0,
        PAGE_READWRITE
        );

    if (!NT_SUCCESS(status)) {
        KdPrint(("M487Filter: ZwMapViewOfSection (user) failed 0x%x\n", status));
        ZwUnmapViewOfSection((HANDLE)-1, kernelVa);
        ZwClose(sectionHandle);
        return status;
    }

    *SectionHandle = sectionHandle;
    *KernelMappingVa = kernelVa;
    *UserVa = userVa;

    KdPrint(("M487Filter: User mapping created - section=%p kernelVa=%p userVa=%p\n",
             sectionHandle, kernelVa, userVa));

    return STATUS_SUCCESS;
}

//
// Default interception configuration - capture all HID IOCTLs
//
static const M487_INTERCEPT_CONFIG DefaultConfig = {
    TRUE,   // CaptureSetFeature
    TRUE,   // CaptureGetFeature
    TRUE,   // CaptureWriteReport
    TRUE,   // CaptureReadReport
    FALSE,  // CaptureStringRequests
    FALSE   // CaptureCollectionInfo
};

//
// Timestamp counter for entries that don't have one from the IRP
//
static LARGE_INTEGER M487InterceptTimestampCounter = { 0 };

//
// Forward declaration for the IO device control handler
//
EVT_WDF_IO_QUEUE_IO_DEVICE_CONTROL M487InterceptEvtIoDeviceControl;

//
// M487InterceptInitialize - Initialize interception subsystem
//
NTSTATUS
M487InterceptInitialize(
    _In_ WDFDEVICE Device,
    _In_ PDEVICE_CONTEXT DevContext
    )
{
    NTSTATUS status;

    PAGED_CODE();

    KdPrint(("M487Filter: M487InterceptInitialize\n"));

    //
    // Initialize ring buffer
    //
    status = M487RingBufferInitialize(Device, &DevContext->InterceptState.RingBuffer);
    if (!NT_SUCCESS(status)) {
        KdPrint(("M487Filter: M487RingBufferInitialize failed 0x%x\n", status));
        return status;
    }

    //
    // Initialize configuration with defaults
    //
    KeInitializeSpinLock(&DevContext->InterceptState.ConfigLock);
    DevContext->InterceptState.Config = DefaultConfig;
    DevContext->InterceptState.Initialized = TRUE;

    //
    // Initialize section handle / user VA for ring buffer sharing
    //
    DevContext->InterceptState.RingBufferSectionHandle = NULL;
    DevContext->InterceptState.RingBufferUserVa = NULL;

    KdPrint(("M487Filter: Interception initialized successfully\n"));
    return STATUS_SUCCESS;
}

//
// M487InterceptCleanup - Clean up interception resources
//
VOID
M487InterceptCleanup(
    _In_ PDEVICE_CONTEXT DevContext
    )
{
    if (DevContext->InterceptState.Initialized) {
        M487RingBufferCleanup(&DevContext->InterceptState.RingBuffer);
        DevContext->InterceptState.Initialized = FALSE;
    }

    //
    // Clean up section handle for user-mode mapping
    //
    if (DevContext->InterceptState.RingBufferSectionHandle != NULL) {
        ZwClose(DevContext->InterceptState.RingBufferSectionHandle);
        DevContext->InterceptState.RingBufferSectionHandle = NULL;
    }
    DevContext->InterceptState.RingBufferUserVa = NULL;
}

//
// M487CaptureEntry - Common helper to capture IOCTL data to ring buffer
//
FORCEINLINE
VOID
M487CaptureEntry(
    _In_ PM487_RING_BUFFER RingBuffer,
    _In_ M487_IOCTL_TYPE IoctlType,
    _In_ ULONG IoctlCode,
    _In_reads_bytes_(DataLength) PVOID Data,
    _In_ size_t DataLength,
    _In_ BOOLEAN IsWrite
    )
{
    PM487_RING_ENTRY entry;
    LARGE_INTEGER timestamp;
    USHORT commitDataLen;

    //
    // Check if this IOCTL type should be captured
    //
    if (RingBuffer->Control == NULL || RingBuffer->Control->Magic != M487_RING_MAGIC) {
        return;
    }

    //
    // Get timestamp
    //
    KeQueryTickCount(&timestamp);

    //
    // Allocate next slot
    //
    entry = M487RingBufferAllocEntry(RingBuffer);
    if (entry == NULL) {
        //
        // Ring buffer full - log error via ETW
        //
        M487FILTER_ETW_LOG_ERROR(STATUS_BUFFER_TOO_SMALL, IoctlCode, 0);
        return;
    }

    //
    // Fill entry header
    //
    entry->Timestamp = timestamp;
    entry->IoctlType = IoctlType;
    entry->IoctlCode = IoctlCode;
    entry->IsWrite = IsWrite;
    entry->ReportId = 0;

    //
    // Copy data (clamp to max)
    //
    commitDataLen = 0;
    if (Data != NULL && DataLength > 0) {
        size_t copyLen = DataLength;
        if (copyLen > RingBuffer->MaxDataSize) {
            copyLen = RingBuffer->MaxDataSize;
        }
        RtlCopyMemory(entry->Data, Data, copyLen);
        commitDataLen = (USHORT)copyLen;
    }

    //
    // Commit the entry
    //
    M487RingBufferCommitEntry(RingBuffer, entry, commitDataLen);

    //
    // ★ Log to ETW - IOCTL captured
    //
    M487FILTER_ETW_LOG_IOCTL(IoctlCode, IoctlType, commitDataLen, IsWrite);

    //
    // ★ Log ring buffer stats to ETW
    //
    M487FILTER_ETW_LOG_RING(
        RingBuffer->Control->TotalCaptured,
        RingBuffer->Control->DroppedCount,
        commitDataLen,
        (UCHAR)(RingBuffer->Control->WriteIndex & 0xFF));
}

//
// M487CaptureSetFeature - Capture IOCTL_HID_SET_FEATURE
//
VOID
M487CaptureSetFeature(
    _In_ PDEVICE_CONTEXT DevContext,
    _In_reads_bytes_(DataLength) PVOID Data,
    _In_ size_t DataLength
    )
{
    KdPrint(("M487Filter: Capture SET_FEATURE (len=%Iu)\n", DataLength));

