keroro1768/M487_ScsiTool/tool/M487Filter/driver/M487FilterIntercept.c
    M487CaptureEntry(
        &DevContext->InterceptState.RingBuffer,
        IoctlType_HID_SET_FEATURE,
        IOCTL_HID_SET_FEATURE,
        Data,
        DataLength,
        TRUE   // Host → Device
    );
}

//
// M487CaptureGetFeature - Capture IOCTL_HID_GET_FEATURE
//
VOID
M487CaptureGetFeature(
    _In_ PDEVICE_CONTEXT DevContext,
    _In_reads_bytes_(DataLength) PVOID Data,
    _In_ size_t DataLength,
    _In_ BOOLEAN FromDevice
    )
{
    KdPrint(("M487Filter: Capture GET_FEATURE (len=%Iu, FromDevice=%d)\n",
             DataLength, FromDevice));

    M487CaptureEntry(
        &DevContext->InterceptState.RingBuffer,
        IoctlType_HID_GET_FEATURE,
        IOCTL_HID_GET_FEATURE,
        Data,
        DataLength,
        FromDevice ? FALSE : TRUE  // FALSE = from device (read), TRUE = to device
    );
}

//
// M487CaptureWriteReport - Capture IOCTL_HID_WRITE_REPORT
//
VOID
M487CaptureWriteReport(
    _In_ PDEVICE_CONTEXT DevContext,
    _In_reads_bytes_(DataLength) PVOID Data,
    _In_ size_t DataLength
    )
{
    KdPrint(("M487Filter: Capture WRITE_REPORT (len=%Iu)\n", DataLength));

    M487CaptureEntry(
        &DevContext->InterceptState.RingBuffer,
        IoctlType_HID_WRITE_REPORT,
        IOCTL_HID_WRITE_REPORT,
        Data,
        DataLength,
        TRUE   // Host → Device
    );
}

//
// M487CaptureReadReport - Capture IOCTL_HID_READ_REPORT
//
VOID
M487CaptureReadReport(
    _In_ PDEVICE_CONTEXT DevContext,
    _In_reads_bytes_(DataLength) PVOID Data,
    _In_ size_t DataLength
    )
{
    KdPrint(("M487Filter: Capture READ_REPORT (len=%Iu)\n", DataLength));

    M487CaptureEntry(
        &DevContext->InterceptState.RingBuffer,
        IoctlType_HID_READ_REPORT,
        IOCTL_HID_READ_REPORT,
        Data,
        DataLength,
        FALSE   // Host ← Device (device reporting to host)
    );
}

//
// M487CaptureIoctl - Capture arbitrary IOCTL
//
VOID
M487CaptureIoctl(
    _In_ PDEVICE_CONTEXT DevContext,
    _In_ ULONG IoctlCode,
    _In_reads_bytes_opt_(DataLength) PVOID Data,
    _In_ size_t DataLength,
    _In_ BOOLEAN IsWrite
    )
{
    M487_IOCTL_TYPE type = M487IoctlToType(IoctlCode);

    KdPrint(("M487Filter: Capture IOCTL 0x%X (type=%d, IsWrite=%d, len=%Iu)\n",
             IoctlCode, type, IsWrite, DataLength));

    M487CaptureEntry(
        &DevContext->InterceptState.RingBuffer,
        type,
        IoctlCode,
        Data,
        DataLength,
        IsWrite
    );
}

//
// M487InterceptForwardIoctl - Forward IOCTL to lower HID device and capture result
//
// This is the key interception function. It:
// 1. Retrieves buffers from the WDFREQUEST
// 2. Optionally captures the outbound data
// 3. Sends the IOCTL to the lower device synchronously
// 4. Captures the returned data
// 5. Returns the status
//
NTSTATUS
M487InterceptForwardIoctl(
    _In_ PDEVICE_CONTEXT DevContext,
    _In_ WDFREQUEST Request,
    _In_ ULONG IoctlCode,
    _In_ WDFMEMORY InputMemory,
    _In_ WDFMEMORY OutputMemory,
    _In_ BOOLEAN IsWriteOperation
    )
{
    WDF_MEMORY_DESCRIPTOR inputDesc;
    WDF_MEMORY_DESCRIPTOR outputDesc;
    NTSTATUS status;
    size_t inputLen = 0;
    size_t outputLen = 0;
    PVOID inputBuf = NULL;
    PVOID outputBuf = NULL;

    //
    // Retrieve buffer pointers for capture
    //
    if (InputMemory != NULL) {
        inputBuf = WdfMemoryGetBuffer(InputMemory, &inputLen);
    }

    if (OutputMemory != NULL) {
        outputBuf = WdfMemoryGetBuffer(OutputMemory, &outputLen);
    }

    //
    // ★ Capture outbound data before sending
    //
    if (inputBuf != NULL && inputLen > 0) {
        M487CaptureIoctl(DevContext, IoctlCode, inputBuf, inputLen, TRUE);
    }

    //
    // Prepare input descriptor
    //
    if (InputMemory != NULL) {
        WDF_MEMORY_DESCRIPTOR_INIT_HANDLE(&inputDesc, InputMemory, NULL);
    } else {
        WDF_MEMORY_DESCRIPTOR_INIT_BUFFER(&inputDesc, NULL, 0);
    }

    //
    // Prepare output descriptor
    //
    if (OutputMemory != NULL) {
        WDF_MEMORY_DESCRIPTOR_INIT_HANDLE(&outputDesc, OutputMemory, NULL);
    } else {
        WDF_MEMORY_DESCRIPTOR_INIT_BUFFER(&outputDesc, NULL, 0);
    }

    //
    // Forward IOCTL to lower device synchronously
    //
    status = WdfIoTargetSendIoctlSynchronously(
        DevContext->LowerHidTarget,
        NULL,
        IoctlCode,
        (InputMemory != NULL) ? &inputDesc : NULL,
        (OutputMemory != NULL) ? &outputDesc : NULL,
        NULL,
        NULL);

    if (!NT_SUCCESS(status)) {
        KdPrint(("M487Filter: Forward IOCTL 0x%X failed 0x%x\n", IoctlCode, status));
    } else {
        KdPrint(("M487Filter: Forward IOCTL 0x%X succeeded\n", IoctlCode));
    }

    //
    // ★ Capture returned data (read operations)
    //
    if (NT_SUCCESS(status) && outputBuf != NULL && outputLen > 0 && !IsWriteOperation) {
        //
        // For GET operations, capture what came back from the device
        //
        switch (IoctlCode) {
        case IOCTL_HID_GET_FEATURE:
            M487CaptureGetFeature(DevContext, outputBuf, outputLen, TRUE);
            break;

        case IOCTL_HID_READ_REPORT:
            M487CaptureReadReport(DevContext, outputBuf, outputLen);
            break;

        default:
            M487CaptureIoctl(DevContext, IoctlCode, outputBuf, outputLen, FALSE);
            break;
        }
    }

    return status;
}

//
// M487InterceptGetConfig - Get current interception configuration
//
VOID
M487InterceptGetConfig(
    _In_ PDEVICE_CONTEXT DevContext,
    _Out_ PM487_INTERCEPT_CONFIG Config
    )
{
    KIRQL irql;

    PAGED_CODE();

    KeAcquireSpinLock(&DevContext->InterceptState.ConfigLock, &irql);
    *Config = DevContext->InterceptState.Config;
    KeReleaseSpinLock(&DevContext->InterceptState.ConfigLock, irql);
}

//
// M487InterceptSetConfig - Set interception configuration
//
VOID
M487InterceptSetConfig(
    _In_ PDEVICE_CONTEXT DevContext,
    _In_ PM487_INTERCEPT_CONFIG Config
    )
{
    KIRQL irql;

    PAGED_CODE();

    KeAcquireSpinLock(&DevContext->InterceptState.ConfigLock, &irql);
    DevContext->InterceptState.Config = *Config;
    KeReleaseSpinLock(&DevContext->InterceptState.ConfigLock, irql);

