keroro1768/M487_ScsiTool/tool/M487Filter/driver/M487FilterIntercept.c
    KdPrint(("M487Filter: Interception config updated - "
             "SetF=%d GetF=%d WriteR=%d ReadR=%d\n",
             Config->CaptureSetFeature,
             Config->CaptureGetFeature,
             Config->CaptureWriteReport,
             Config->CaptureReadReport));

    //
    // ★ Log config change via ETW
    //
    M487FILTER_ETW_LOG_CONFIG(
        Config->CaptureSetFeature,
        Config->CaptureGetFeature,
        Config->CaptureWriteReport,
        Config->CaptureReadReport);
}

//
// M487InterceptGetRingBufferInfo - Get ring buffer info for user-mode mapping
//
NTSTATUS
M487InterceptGetRingBufferInfo(
    _In_ PDEVICE_CONTEXT DevContext,
    _Out_ PULONG64 RingBufferPhysAddr,
    _Out_ PULONG RingBufferSize
    )
{
    PM487_RING_BUFFER ringBuffer;

    if (!DevContext->InterceptState.Initialized) {
        return STATUS_INVALID_DEVICE_STATE;
    }

    ringBuffer = &DevContext->InterceptState.RingBuffer;

    if (ringBuffer->ControlMemory == NULL) {
        return STATUS_INVALID_DEVICE_STATE;
    }

    //
    // Get the physical address of the ring buffer
    //
    {
        PHYSICAL_ADDRESS physAddr;

        //
        // Query for the physical address
        // For WDFMEMORY, we use WdfMemoryGetBuffer and query MDL
        //
        physAddr = MmGetPhysicalAddress(ringBuffer->Control);

        *RingBufferPhysAddr = physAddr.QuadPart;
        *RingBufferSize = ringBuffer->Control->RingByteSize;
    }

    KdPrint(("M487Filter: RingBuffer physAddr=0x%I64X, size=%lu\n",
             *RingBufferPhysAddr, *RingBufferSize));

    return STATUS_SUCCESS;
}

//
// M487InterceptGetStats - Get capture statistics
//
NTSTATUS
M487InterceptGetStats(
    _In_ PDEVICE_CONTEXT DevContext,
    _Out_ PULONG64 TotalCaptured,
    _Out_ PULONG DroppedCount,
    _Out_ PULONG CurrentUsed
    )
{
    if (!DevContext->InterceptState.Initialized) {
        return STATUS_INVALID_DEVICE_STATE;
    }

    return M487RingBufferGetStats(
        &DevContext->InterceptState.RingBuffer,
        TotalCaptured,
        DroppedCount,
        CurrentUsed);
}

//
// M487InterceptProcessSetFeature - Process IOCTL_HID_SET_FEATURE
//
// Called when a SET_FEATURE request needs to be handled.
// This extracts the report from the request, captures it,
// and forwards it to the lower device.
//
NTSTATUS
M487InterceptProcessSetFeature(
    _In_ PDEVICE_CONTEXT DevContext,
    _In_ WDFREQUEST Request
    )
{
    WDFMEMORY inputMemory;
    NTSTATUS status;

    //
    // Retrieve input buffer (Feature report)
    //
    status = WdfRequestRetrieveInputMemory(Request, &inputMemory);
    if (!NT_SUCCESS(status)) {
        KdPrint(("M487Filter: RetrieveInputMemory failed 0x%x\n", status));
        return status;
    }

    //
    // Capture the SET_FEATURE report
    //
    {
        PVOID buf;
        size_t len;
        buf = WdfMemoryGetBuffer(inputMemory, &len);
        M487CaptureSetFeature(DevContext, buf, len);
    }

    //
    // Forward to lower device
    // Note: inputMemory is owned by Request, don't WdfMemoryDelete it
    //
    status = M487InterceptForwardIoctl(
        DevContext,
        Request,
        IOCTL_HID_SET_FEATURE,
        inputMemory,
        NULL,
        TRUE   // Write operation
    );

    return status;
}

//
// M487InterceptProcessGetFeature - Process IOCTL_HID_GET_FEATURE
//
NTSTATUS
M487InterceptProcessGetFeature(
    _In_ PDEVICE_CONTEXT DevContext,
    _In_ WDFREQUEST Request,
    _In_ size_t OutputBufferLength
    )
{
    WDFMEMORY outputMemory;
    NTSTATUS status;

    if (OutputBufferLength == 0) {
        return STATUS_BUFFER_TOO_SMALL;
    }

    //
    // Allocate output buffer for the feature report
    //
    status = WdfRequestRetrieveOutputMemory(Request, &outputMemory);
    if (!NT_SUCCESS(status)) {
        KdPrint(("M487Filter: RetrieveOutputMemory failed 0x%x\n", status));
        return status;
    }

    //
    // Forward to lower device and capture result
    //
    status = M487InterceptForwardIoctl(
        DevContext,
        Request,
        IOCTL_HID_GET_FEATURE,
        NULL,
        outputMemory,
        FALSE  // Read operation
    );

    if (NT_SUCCESS(status)) {
        //
        // Report was already captured in M487InterceptForwardIoctl
        // Just complete the request with the data
        //
        size_t bytesCopied;
        PVOID buf = WdfMemoryGetBuffer(outputMemory, &bytesCopied);

        KdPrint(("M487Filter: GET_FEATURE returned %Iu bytes\n", bytesCopied));
        WdfRequestSetInformation(Request, bytesCopied);
    }

    //
    // Note: outputMemory is owned by Request, don't WdfMemoryDelete it
    //
    return status;
}

//
// M487InterceptProcessWriteReport - Process IOCTL_HID_WRITE_REPORT
//
NTSTATUS
M487InterceptProcessWriteReport(
    _In_ PDEVICE_CONTEXT DevContext,
    _In_ WDFREQUEST Request
    )
{
    WDFMEMORY inputMemory;
    NTSTATUS status;

    status = WdfRequestRetrieveInputMemory(Request, &inputMemory);
    if (!NT_SUCCESS(status)) {
        KdPrint(("M487Filter: RetrieveInputMemory (WRITE_REPORT) failed 0x%x\n", status));
        return status;
    }

    {
        PVOID buf;
        size_t len;
        buf = WdfMemoryGetBuffer(inputMemory, &len);
        M487CaptureWriteReport(DevContext, buf, len);
    }

    status = M487InterceptForwardIoctl(
        DevContext,
        Request,
        IOCTL_HID_WRITE_REPORT,
        inputMemory,
        NULL,
        TRUE
    );

    //
    // Note: inputMemory is owned by Request, don't WdfMemoryDelete it
    //
    return status;
}

//
// M487InterceptProcessReadReport - Process IOCTL_HID_READ_REPORT
//
NTSTATUS
M487InterceptProcessReadReport(
    _In_ PDEVICE_CONTEXT DevContext,
    _In_ WDFREQUEST Request,
    _In_ size_t OutputBufferLength
    )
{
    WDFMEMORY outputMemory;
    NTSTATUS status;

    if (OutputBufferLength == 0) {
        return STATUS_BUFFER_TOO_SMALL;
    }

    status = WdfRequestRetrieveOutputMemory(Request, &outputMemory);
    if (!NT_SUCCESS(status)) {
        KdPrint(("M487Filter: RetrieveOutputMemory (READ_REPORT) failed 0x%x\n", status));
        return status;
    }

