keroro1768/M487_ScsiTool/tool/M487Filter/driver/M487FilterIntercept.c
    status = M487InterceptForwardIoctl(
        DevContext,
        Request,
        IOCTL_HID_READ_REPORT,
        NULL,
        outputMemory,
        FALSE
    );

    if (NT_SUCCESS(status)) {
        size_t bytesCopied;
        PVOID buf = WdfMemoryGetBuffer(outputMemory, &bytesCopied);

        KdPrint(("M487Filter: READ_REPORT returned %Iu bytes\n", bytesCopied));
        WdfRequestSetInformation(Request, bytesCopied);
    }

    //
    // Note: outputMemory is owned by Request, don't WdfMemoryDelete it
    //
    return status;
}

//
// M487InterceptEvtIoDeviceControl - Main IOCTL dispatch handler
//
// This is the central handler for all intercepted HID IOCTLs.
// It is called by KMDF for IOCTLs that we registered for via
// WdfDeviceConfigureRequestDispatching.
//
// For HID IOCTLs we intercept, we:
//  1. Capture the data to the ring buffer
//  2. Optionally modify the data (if in modifying mode)
//  3. Forward the IOCTL to the lower HID device
//  4. Optionally capture the response
//  5. Complete the request
//
VOID
M487InterceptEvtIoDeviceControl(
    _In_ WDFQUEUE Queue,
    _In_ WDFREQUEST Request,
    _In_ size_t OutputBufferLength,
    _In_ size_t InputBufferLength,
    _In_ ULONG IoControlCode
    )
{
    PDEVICE_CONTEXT devContext;
    WDFDEVICE device;
    NTSTATUS status;
    size_t bytesReturned = 0;

    UNREFERENCED_PARAMETER(OutputBufferLength);
    UNREFERENCED_PARAMETER(InputBufferLength);

    device = WdfQueueGetDevice(Queue);
    devContext = WdfObjectGet_DEVICE_CONTEXT(device);

    KdPrint(("M487Filter: ★ Intercepted IOCTL 0x%X (In=%Iu, Out=%Iu)\n",
             IoControlCode, InputBufferLength, OutputBufferLength));

    switch (IoControlCode) {

    case IOCTL_HID_SET_FEATURE:
        KdPrint(("M487Filter:  → SET_FEATURE intercepted\n"));
        status = M487InterceptProcessSetFeature(devContext, Request);
        WdfRequestCompleteWithInformation(Request, status, bytesReturned);
        return;

    case IOCTL_HID_GET_FEATURE:
        KdPrint(("M487Filter:  → GET_FEATURE intercepted\n"));
        status = M487InterceptProcessGetFeature(devContext, Request, OutputBufferLength);
        if (NT_SUCCESS(status)) {
            bytesReturned = OutputBufferLength;
        }
        WdfRequestCompleteWithInformation(Request, status, bytesReturned);
        return;

    case IOCTL_HID_WRITE_REPORT:
        KdPrint(("M487Filter:  → WRITE_REPORT intercepted\n"));
        status = M487InterceptProcessWriteReport(devContext, Request);
        WdfRequestCompleteWithInformation(Request, status, bytesReturned);
        return;

    case IOCTL_HID_READ_REPORT:
        KdPrint(("M487Filter:  → READ_REPORT intercepted\n"));
        status = M487InterceptProcessReadReport(devContext, Request, OutputBufferLength);
        if (NT_SUCCESS(status)) {
            bytesReturned = OutputBufferLength;
        }
        WdfRequestCompleteWithInformation(Request, status, bytesReturned);
        return;

    default:
        //
        // Unknown HID IOCTL - should not happen if registered correctly
        // Just forward to lower device automatically
        //
        KdPrint(("M487Filter:  → Unknown IOCTL 0x%X - forwarding\n", IoControlCode));

        //
        // Forward to lower device via automatic pass-through
        // Since we registered with WdfFdoInitSetFilter, KMDF auto-forwards
        // IRPs that we don't explicitly handle here.
        //
        WdfRequestCompleteWithInformation(Request, STATUS_SUCCESS, 0);
        return;
    }
}

//
// M487InterceptRegisterIoctls - Register HID IOCTLs to be intercepted
//
// This configures the default queue to dispatch specific IOCTLs to our
// EvtIoDeviceControl callback instead of letting them pass through
// automatically.
//
// The key HID IOCTLs we intercept:
//   - IOCTL_HID_SET_FEATURE    (host → device feature report)
//   - IOCTL_HID_GET_FEATURE    (host ← device feature report)
//   - IOCTL_HID_WRITE_REPORT   (host → device output report)
//   - IOCTL_HID_READ_REPORT    (host ← device input report)
//
NTSTATUS
M487InterceptRegisterIoctls(
    _In_ WDFDEVICE Device
    )
{
    NTSTATUS status;

    PAGED_CODE();

    KdPrint(("M487Filter: Registering HID IOCTL intercept handlers\n"));

    //
    // Configure the default queue to dispatch HID IOCTLs to our handler.
    // By calling WdfDeviceConfigureRequestDispatching with each specific
    // IOCTL code, KMDF will route those IOCTLs to our EvtIoDeviceControl
    // callback instead of auto-passing them through.
    //
    // Note: WdfDeviceConfigureRequestDispatching must be called for each
    // IOCTL we want to intercept. All other IOCTLs continue to use
    // automatic pass-through from WdfFdoInitSetFilter.
    //

    status = WdfDeviceConfigureRequestDispatching(
        Device,
        WdfRequestDeviceIoControl,
        WdfDeviceIoControlled,
        IOCTL_HID_SET_FEATURE);

    if (!NT_SUCCESS(status)) {
        KdPrint(("M487Filter: Register SET_FEATURE failed 0x%x\n", status));
        return status;
    }

    status = WdfDeviceConfigureRequestDispatching(
        Device,
        WdfRequestDeviceIoControl,
        WdfDeviceIoControlled,
        IOCTL_HID_GET_FEATURE);

    if (!NT_SUCCESS(status)) {
        KdPrint(("M487Filter: Register GET_FEATURE failed 0x%x\n", status));
        return status;
    }

    status = WdfDeviceConfigureRequestDispatching(
        Device,
        WdfRequestDeviceIoControl,
        WdfDeviceIoControlled,
        IOCTL_HID_WRITE_REPORT);

    if (!NT_SUCCESS(status)) {
        KdPrint(("M487Filter: Register WRITE_REPORT failed 0x%x\n", status));
        return status;
    }

    status = WdfDeviceConfigureRequestDispatching(
        Device,
        WdfRequestDeviceIoControl,
        WdfDeviceIoControlled,
        IOCTL_HID_READ_REPORT);

    if (!NT_SUCCESS(status)) {
        KdPrint(("M487Filter: Register READ_REPORT failed 0x%x\n", status));
        return status;
    }

    //
    // Get the default queue and set our device control handler.
    // The handler will be called for all IOCTLs registered above.
    //
    {
        WDFQUEUE queue;
        WDF_IO_QUEUE_CONFIG queueConfig;

        queue = WdfDeviceGetDefaultQueue(Device);

        WDF_IO_QUEUE_CONFIG_INIT(&queueConfig, WdfIoQueueDispatchParallel);
        queueConfig.EvtIoDeviceControl = M487InterceptEvtIoDeviceControl;

        //
        // Reconfigure the default queue with our handler.
        // Forward-only queue will not keep requests.
        //
        status = WdfIoQueueConfigure(
            queue,
            WDF_NO_OBJECT_ATTRIBUTES,
            &queueConfig);

        if (!NT_SUCCESS(status)) {
            KdPrint(("M487Filter: WdfIoQueueConfigure failed 0x%x\n", status));
            return status;
        }
    }

    KdPrint(("M487Filter: HID IOCTL interception registered (SET/GET/READ/WRITE_REPORT)\n"));
    return STATUS_SUCCESS;
}

//
// M487InterceptMapRingBufferToUser - Map ring buffer to user-mode address space.
//
// Creates a section object and maps the ring buffer into both kernel and
// user address spaces. The first call creates and caches the mapping;
// subsequent calls return the cached user-mode address.
//
// This allows user-mode applications (like hidlog.exe) to directly read
// captured HID packets without kernel/user transitions for each read.
//
// Parameters:
//   DevContext    - Device context
//   UserVa       - Out: User-mode virtual address of mapped ring buffer
//   RingBufferSize - Out: Total size of ring buffer in bytes
//   SlotSize     - Out: Size of each ring buffer slot
//   SlotCount    - Out: Number of slots
//   MaxDataSize  - Out: Maximum data bytes per slot
//
NTSTATUS
M487InterceptMapRingBufferToUser(
    _In_ PDEVICE_CONTEXT DevContext,
    _Out_ PULONG64 UserVa,
    _Out_ PULONG RingBufferSize,
    _Out_ PULONG SlotSize,
    _Out_ PULONG SlotCount,
    _Out_ PULONG MaxDataSize
    )
{
    PM487_RING_BUFFER ringBuffer;
    HANDLE sectionHandle = NULL;
    PVOID kernelVa = NULL;
    PVOID userVa = NULL;
    LARGE_INTEGER sectionSize;
    LARGE_INTEGER sectionOffset;
    SIZE_T viewSize;
    NTSTATUS status;

    PAGED_CODE();

    if (UserVa == NULL || RingBufferSize == NULL ||
        SlotSize == NULL || SlotCount == NULL || MaxDataSize == NULL) {
        return STATUS_INVALID_PARAMETER;
    }

    ringBuffer = &DevContext->InterceptState.RingBuffer;

    if (ringBuffer->Control == NULL) {
        return STATUS_INVALID_DEVICE_STATE;
    }

    //
    // If already mapped, return cached address
    //
    if (DevContext->InterceptState.RingBufferUserVa != NULL &&
        DevContext->InterceptState.RingBufferSectionHandle != NULL) {
        *UserVa = (ULONG64)DevContext->InterceptState.RingBufferUserVa;
        *RingBufferSize = ringBuffer->Control->RingByteSize;
        *SlotSize = ringBuffer->SlotSize;
        *SlotCount = ringBuffer->SlotCount;
        *MaxDataSize = ringBuffer->MaxDataSize;
        KdPrint(("M487Filter: Returning cached ring buffer mapping: Va=0x%I64X\n", *UserVa));
        return STATUS_SUCCESS;
    }

    //
    // Create a section object for the ring buffer
    //
    sectionSize.QuadPart = (LONGLONG)ringBuffer->Control->RingByteSize;

    status = ZwCreateSection(
        &sectionHandle,
        SECTION_ALL_ACCESS,           // DesiredAccess
        NULL,                          // ObjectAttributes
        &sectionSize,                  // MaximumSize
        PAGE_READWRITE,                // PageAttribut
        SEC_COMMIT,                    // SectionAttributes
        NULL                           // FileHandle (memory section)
        );

    if (!NT_SUCCESS(status)) {
        KdPrint(("M487Filter: ZwCreateSection failed 0x%x\n", status));
        return status;
    }

    //
    // Map the section into kernel address space
    //
    viewSize = (SIZE_T)ringBuffer->Control->RingByteSize;
    sectionOffset.QuadPart = 0;
    kernelVa = NULL;

    status = ZwMapViewOfSection(
        sectionHandle,
        (HANDLE)-1,                   // Current process
        &kernelVa,
        0,                             // ZeroBits
        viewSize,
        &sectionOffset,
        &viewSize,
        ViewShare,                     // InheritDisposition
        0,                             // AllocationType
        PAGE_READWRITE                 // Protect
        );

    if (!NT_SUCCESS(status)) {
        KdPrint(("M487Filter: ZwMapViewOfSection (kernel) failed 0x%x\n", status));
        ZwClose(sectionHandle);
        return status;
    }

    //
    // Copy current ring buffer contents to the shared section
    //
    RtlCopyMemory(kernelVa, ringBuffer->Control, (SIZE_T)ringBuffer->Control->RingByteSize);

    //
    // Map the section into user address space
    //
    viewSize = (SIZE_T)ringBuffer->Control->RingByteSize;
    sectionOffset.QuadPart = 0;
    userVa = NULL;

    status = ZwMapViewOfSection(
        sectionHandle,
        (HANDLE)-1,                   // Current user process
        &userVa,
        0,
        viewSize,
        &sectionOffset,
        &viewSize,
        ViewShare,
        0,
        PAGE_READWRITE
        );

    if (!NT_SUCCESS(status)) {
        KdPrint(("M487Filter: ZwMapViewOfSection (user) failed 0x%x\n", status));
        ZwUnmapViewOfSection((HANDLE)-1, kernelVa);
        ZwClose(sectionHandle);
        return status;
    }

    //
    // Cache the mapping in device context
    //
    DevContext->InterceptState.RingBufferSectionHandle = sectionHandle;
    DevContext->InterceptState.RingBufferUserVa = userVa;

    //
    // Return the user-mode VA and metadata
    //
    *UserVa = (ULONG64)userVa;
    *RingBufferSize = ringBuffer->Control->RingByteSize;
    *SlotSize = ringBuffer->SlotSize;
    *SlotCount = ringBuffer->SlotCount;
    *MaxDataSize = ringBuffer->MaxDataSize;

    KdPrint(("M487Filter: Ring buffer mapped to user VA=0x%I64X, size=%lu\n",
             *UserVa, *RingBufferSize));

    UNREFERENCED_PARAMETER(kernelVa);
    return STATUS_SUCCESS;
}
